; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-7-0)
(:domain BLOCKS)
(:objects A B C D E F G - block)
(:INIT (CLEAR A) (CLEAR G) (ONTABLE B) (ONTABLE C) (ON A B) (ON G F) (ON F E) (ON E D) (ON D C) (HANDEMPTY))
(:goal (AND (ON G F) (ON F E) (ON E D) (ON D C) (ON C B) (ON B A)))
)

; plan
1. (unstack a b)
   deleted: (clear a) (handempty) (on a b)
   added: (holding a) (clear b)
   goals met: 4 of 6
2. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 4 of 6
3. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 4 of 6
4. (stack b a)
   deleted: (holding b) (clear a)
   added: (clear b) (handempty) (on b a)
   goals met: 5 of 6
5. (unstack g f)
   deleted: (clear g) (handempty) (on g f)
   added: (holding g) (clear f)
   goals met: 4 of 6
6. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 4 of 6
7. (unstack f e)
   deleted: (clear f) (handempty) (on f e)
   added: (holding f) (clear e)
   goals met: 3 of 6
8. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 3 of 6
9. (unstack e d)
   deleted: (clear e) (handempty) (on e d)
   added: (holding e) (clear d)
   goals met: 2 of 6
10. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 2 of 6
11. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 2 of 6
12. (stack f e)
   deleted: (holding f) (clear e)
   added: (clear f) (handempty) (on f e)
   goals met: 3 of 6
13. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 3 of 6
14. (stack g f)
   deleted: (holding g) (clear f)
   added: (clear g) (handempty) (on g f)
   goals met: 4 of 6
15. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 3 of 6
16. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 3 of 6
17. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 3 of 6
18. (stack c b)
   deleted: (holding c) (clear b)
   added: (clear c) (handempty) (on c b)
   goals met: 4 of 6
19. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 4 of 6
20. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 5 of 6
21. (unstack g f)
   deleted: (clear g) (handempty) (on g f)
   added: (holding g) (clear f)
   goals met: 4 of 6
22. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 4 of 6
23. (unstack f e)
   deleted: (clear f) (handempty) (on f e)
   added: (holding f) (clear e)
   goals met: 3 of 6
24. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 3 of 6
25. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 3 of 6
26. (stack e d)
   deleted: (holding e) (clear d)
   added: (clear e) (handempty) (on e d)
   goals met: 4 of 6
27. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 4 of 6
28. (stack f e)
   deleted: (holding f) (clear e)
   added: (clear f) (handempty) (on f e)
   goals met: 5 of 6
29. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 5 of 6
30. (stack g f)
   deleted: (holding g) (clear f)
   added: (clear g) (handempty) (on g f)
   goals met: 6 of 6
